{"data":{"site":{"siteMetadata":{"title":"My Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"4e7c9123-2bbd-50fb-86a0-98c13fac8683","excerpt":"tl;dr: since learning how to code, I’ve become obsessed with building things\nwith the end-goal of making something worthy enough of landing…","html":"<p><strong>tl;dr: since learning how to code, I’ve become obsessed with building things\nwith the end-goal of making something worthy enough of landing me a job as a\ndeveloper.</strong></p>\n<p>A few weeks back, I came across an article on Hacker News that really resonated\nwith me. The title of that article was “Getting Too Absorbed in Your Side\nProjects”<sup>1</sup> and the topic is hopefully self-explanatory. I’ve written about my own\nexperiences with side projects and how I go about building them, but one aspect\nof side projects I left out was my attitude towards them. Like Bennet, I too\nfound myself becoming fixated with my side projects, so much so that my mental\nhealth was being negatively effected.</p>\n<p>In this post, I would like to dive deeper into how I became so fixated with\nmaking things, what the consequences were, and the things that have helped me\novercome my fixation.</p>\n<h2>From Initiation to Regular Use</h2>\n<p>Soon after starting my journey of learning how to code back in late 2015, I realized\nI wanted to become a software developer. Not knowing what exactly it took to get\na job writing code, I googled “how to become a software developer” and devoured as\nmuch as I could on the subject. After reading various articles and watching\ncountless YouTube videos, it became apparent that having experience was the common\ndenominator out of all the advice being given.</p>\n<p>Unlike other professions, however, experience doesn’t necessarily have to be\ngained from a professional environment. When it comes to software development,\nexperience can be gained by contributing to open source software or <em>building your\nown projects</em>—and this is where I got the idea to make my own things.</p>\n<p>Once I realized I could potentially land a job by building side projects, I\nnever looked back. I started side projects that I thought would be beneficial\nto have on my resume: first I made an Android app since I had just learned Java\nin school, moving on to simple static websites using HTML and CSS, then on to\nbrowser extensions before working towards building full-fledged web apps.</p>\n<p>In the beginning, ideas were a dime a dozen. As I worked on one side project, I\nwould have a new idea for the next one. Like many others, the appeal for the new\nidea far outweighed the current project I was working on so I would typically\nchase the new idea, leaving the old one unfinished.</p>\n<p>This cycle of having an idea, to coding, to sometimes launching, back to having\nanother idea, soon became another habit of mine, just like having a cup of\ncoffee every morning. </p>\n<p>But when I didn’t feed into this side project cycle (as I like to call it), my\nmental well-being started being negatively-affected.</p>\n<h2>Dependence</h2>\n<p>My side project cycle was so insidious that it\ntook nearly two years before I realized the extent to which it had a hold on me.\nThis realization came from finishing a side project one day without an idea lined\nup for the next one and feeling panic and somewhat anxious.</p>\n<p>I racked my brain scouring for ideas because I was uncomfortable not spending my\nfree time working on a side project. This uneasiness lasted for a few days before\nI finally came up with an idea for the next project, albeit one that really wasn’t\nuseful for anyone, myself included.</p>\n<p>Regardless, working on that latest idea made my anxiety and uneasiness go away\nso I was happy to be doing <em>something</em>. Initially, I didn’t give much thought to\nthe feeling of being uncomfortable with not being productive. It wasn’t until\nthose same feelings washed over me again that I realized I was dependent on the\nside project cycle.</p>\n<p>After this realization, I tried to defend my addiction by reminding myself of the\npotential benefits it could have on my career:</p>\n<blockquote>\n<p>“Think of all the experience you’ve gained!”</p>\n</blockquote>\n<blockquote>\n<p>“Your next side project could be the next Facebook!”</p>\n</blockquote>\n<p>The problem with these statements was that the projects I had made were trivial\nin comparison to projects people use to land jobs. Rarely did they solve any\nmajor issue; the projects lacked complexity and depth which meant I would have\na hard time speaking technically about these projects with potential employers.</p>\n<p>This took some time to accept, but once I did come to terms with my unhealthy\nhabit of building side projects, I began to wean myself from the addictive cycle.</p>\n<h2>Recovery</h2>\n<p>Consuming media for pure enjoyment has been one of the biggest factors in combating\nmy addition. Watching Netflix, reading books, and playing video games\nhave all taken out large chunks of time that I would have previously spent\nmindlessly coding. These actions have also brought me closer to those I care\nabout in my life like my girlfriend and best friend.</p>\n<p>When the weather permits, I also enjoy playing football with friends, going on\nbike rides, and hiking. For nearly two years, the most exercise I got was from\nwalking so getting out of the house and being physically active has significantly\nimproved my well-being.</p>\n<p>Although I still occasionally work on side projects, they no longer have an\naddictive grip on me; I feel no obligation to be constantly working on them.\nInstead of seeing side projects as a means to an end, I now view them simply\nas an end—things I can work on because I enjoy doing them.</p>\n<p>This change in perspective has allowed me to build more complex and meaningful\nprojects all the while maintaining my sanity.</p>\n<hr />\n<ol>\n<li><a href=\"https://www.bennettnotes.com/post/getting-too-absorbed-into-your-side-projects/\">https://www.bennettnotes.com/post/getting-too-absorbed-into-your-side-projects/</a></li>\n</ol>","frontmatter":{"title":"On Side Project Addiction","date":"April 04, 2019","draft":false}}},"pageContext":{"slug":"/side-project-addiction/","previous":{"fields":{"slug":"/ceddy-spaghetti-studios/"},"frontmatter":{"title":"Ceddy Spaghetti Studios"}},"next":null}}