{"data":{"site":{"siteMetadata":{"title":"My Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"1b2aac4b-6d09-5743-9034-ffc75fc91007","excerpt":"For those who don’t know, I’m a Computer Science major and I enjoy programming\noutside of school and work. There’s something about getting…","html":"<p>For those who don’t know, I’m a Computer Science major and I enjoy programming\noutside of school and work. There’s something about getting to make whatever you\nwant while also having total ownership of a project that makes building side\nprojects so addicting. I’ve heard it compared to other hobbies such as gaming\nor playing sports.</p>\n<p>Although many side projects may go unfinished or unreleased,\nI feel as though there is still a lot of experience to gain from simply starting\na project in the first place. In this post, I will walk you through my process\nof coming up with an idea of what to make, taking said idea and turning it into\nsomething tangible, to putting the project out in the world.</p>\n<p>Before we begin, I will warn you that my process is by no means perfect. As I’ll\ndiscuss later, there are a few things I would like to do differently in the future\nsince my current process of building side projects can seem anomalous at times.</p>\n<h4>Coming Up with an Idea 💡</h4>\n<p>In order to build something, you first need an idea. I find this to be one of\nthe hardest parts of side projects. This is simply because if there is no idea,\nthere can’t be a project. To get around this potential roadblock, I like to\nexamine my own daily life and see what areas I could possibly speed up or\nimprove. Having intimate knowledge of the problem you’re trying to solve will\nmake building a side project that much easier.</p>\n<h4>Preliminary Research 🧐</h4>\n<p>Once I have an idea in mind, I like to see what existing solutions already exist.\nNow, if I find more than a few existing projects that solve the same issue that\nI was hoping to tackle, then I usually will not continue with that project. This\nis one of those situations that I mentioned earlier where I’m sort of peculiar—\nthe fact that there are already projects that try to solve an issue means that\nyour idea has already been validated—this is good news! Don’t be discouraged if\nthere are already other projects out there. </p>\n<p>I find that if I do try to tackle such problems, I will often mimic the existing\nprojects’ solutions rather than building something unique. Although imitating one\nproject’s solution to help you solve an issue can be helpful, I have found that\nrelying too much on this method then makes it harder for me to build projects that\nrequire unique and sophisticated solutions later on.</p>\n<h4>Choosing a Tech Stack 🥞</h4>\n<p>Now that I have an idea and know I want to commit to this side project, the next\nthing I do is research what tech stack I will use to turn the idea into a real\nthing. This step assumes you’ve already determined the area or type of project\nyou are going to make—be it a browser extension, CLI tool, a web or mobile app,\netc. I love JavaScript and thanks to the run-time environment Node.js, I can make\nprojects as just about any application type. With the language selected, I then\nwill decide if I want to use any libraries that could help speed up the\ndevelopment time and if I’m unfamiliar with a particular library, I will read\ntheir documentation.</p>\n<h4>Coding → MVP 🦴</h4>\n<p>Time for the fun part: coding! With an idea in mind and the right tools selected\nto build said idea, I get to work. Programming can be a double-edged sword when\ncreating a side project: when it’s going well, I love it. But when I get stuck on\nan issue that I can’t immediately solve, I also really hate it. Throughout the\ndevelopment process, these two emotions can cycle between overpowering one\nanother. At times, I feel so defeated by a bug and want to give up entirely only\nto get the biggest boost of confidence after stepping away and figuring out how\nto squash the bug. I like to say making side projects can be like war—it’s\nessentially a series of battles composed of wins and losses, me versus my code.</p>\n<p>Eventually I come out victorious and emerge with something that works and solves\nthe original problem. This will almost always be a minimum viable product, or MVP.\nThe MVP serves as the skeleton for the finished product without all the bells and\nwhistles that will eventually make it complete.</p>\n<h4>Break from Code—Design Time 🎨</h4>\n<p>This is the step in the process where I like to start thinking about how I will\nmarket my side project while also giving myself a break from coding. Like a\nnewborn baby, the project needs a name. This can be as simple or extravagant as\nyou would like. Once a name is selected, I think about branding. What will the\nmain colors of the project be? What graphic or logo can best represent this\nproject? What font? Having answers to those questions then allows me to put my\ncreativity to use. Using design software (I’m a big fan of Sketch), I will put\ntogether a press kit or package of promotional material (namely good-looking\ngraphics) to be used later on for open graph meta tags or product launches on\nsites like Product Hunt or Reddit.</p>\n<h4>Wrapping Up 🎀</h4>\n<p>Seem like a long process yet? Luckily, we’re just about done. After my creative\nsprint, I go back to programming and flesh out the MVP. On goes the remaining\nfeatures I thought would be useful and any bug fixes that are critical.</p>\n<p>Note: there will always be bugs, so do not try to fix them all before launching\nyour product.</p>\n<h4>Launching 🚀</h4>\n<p>By now, I have a finished product and I’m ready to show it to the world. With the\npress kit I made earlier, I hit up several relevant subreddits to the project I\njust made and create posts that describe what the project is, why I made it, and\nwhere to find it. Posting on Reddit will give my project some exposure and\nfeedback that I can then use to fix or tweak before launching on Product Hunt.</p>\n<hr>\n<h4>Looking Ahead 🔭</h4>\n<p>After having gone through this entire process several times and starting the\nprocess but not finishing many more times, I feel as though there is room\nfor improvement.</p>\n<p>Firstly, deciding whether or not to build something based on the number of\nexisting projects is kind of silly. Even if there are many solutions out there,\nyour take and solution to the problem is unique and therefore could end up\nbeing a better solution than all the other projects.</p>\n<p>Lastly, it’s really important to get your project out in the hands of the public\nas soon as possible as this will significantly improve your chances of actually\ncompleting it. Too many times to count have I worked on a project in isolation\nwithout letting others try it which resulted in a “failed” launch. This is simply\ndue to the fact that I assumed I knew what people would want, rather than actually\nletting them tell me. A costly mistake if you’re hoping to have users other than\nyourself use the project.</p>\n<p>So what’s in store? I hope to work on the above issues while also continually\nimproving the process I’ve since been following. I feel as though the side\nprojects I’ve made up until this point have been quite small in scope, so in the\nfuture I also plan on taking on larger problems that require more complex\nsolutions. Finally, I would love to make something that I can monetize and earn\nsome extra side income from.</p>\n<p>I guess I already have some goals for 2019.</p>","frontmatter":{"title":"My Process of Building Side Projects","date":"December 18, 2018","draft":false}}},"pageContext":{"slug":"/building-side-projects/","previous":{"fields":{"slug":"/advice-for-beginners/"},"frontmatter":{"title":"Advice for Beginners"}},"next":{"fields":{"slug":"/reddits-save-functionality-sucks/"},"frontmatter":{"title":"Reddit's Save Functionality Sucks"}}}}