{"data":{"site":{"siteMetadata":{"title":"My Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"64142374-2977-526f-946c-ed6b7a8fe589","excerpt":"Read about my OCD of doing things by the book and how it causes me anxiety and\nplagues my ability to get anything done. I’m not sure if…","html":"<p>Read about my OCD of doing things by the book and how it causes me anxiety and\nplagues my ability to get anything done.</p>\n<p>I’m not sure if there’s a word for this, but I enjoy doing things as real as\npossbile, maybe better put, done by the book. It’s hard for me to articulate\nwhat exactly I mean by that, so for the purpose of this post, I’ll explain one\nsimple and contrived example that I’ve come across recently.</p>\n<p>Think of a website, any website. I just thought of Twitter. Now, visit the site\nin mind locate the footer of the site. There you will most likely see multiple\nlinks, probably some about the product, the company, the legal things, etc. I’d\nbet there is also a statement that looks somewhere along the lines of:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">© &lt;year&gt; &lt;company_name&gt;</code></pre></div>\n<p>Am I right? You may be wondering, “Why is Cedric writing about footer copyright\nnotices?” Let me explain. My current side project is called unearth and recently\nI have been designing and coding the landing page. Now, when I got to the footer,\n<em>I wanted to do things as real as possible</em> and decided to throw in the\naforementioned copyright noteice, to make things look legit, you know? This is\nthe crazy part.</p>\n<p>Initially, I put <code class=\"language-text\">© 2019 Unearth</code>. A few minutes later, I thought, “Is that even\nlegal? What is Unearth, I don’t actually own a company named Unearth.”\nAfter spending a few more minutes looking for inspiration, I decided to change\n“Unearth” to “Unearth Labs” because that’s what Notion (notion.so) does.</p>","frontmatter":{"title":"Ceddy Spaghetti Studios","date":"February 16, 2019","draft":false}}},"pageContext":{"slug":"/ceddy-spahetti-studios/","previous":{"fields":{"slug":"/reddits-save-functionality-sucks/"},"frontmatter":{"title":"Reddit's Save Functionality Sucks"}},"next":null}}