{"data":{"site":{"siteMetadata":{"title":"Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"44d1de0c-2b9e-5ad5-bc21-25d72fca3c81","excerpt":"No, I haven’t moved physically. Rather, I’ve moved my blog. My first blog,\n coffee. code. cedric , was hosted on Medium when that was the…","html":"<p>No, I haven’t moved physically. Rather, I’ve moved my blog. My first blog,\n<em>coffee. code. cedric</em>, was hosted on Medium when that was the cool thing to do.\nI even had a custom domain for my publication before that\n<a href=\"https://help.medium.com/hc/en-us/articles/115003053487%0A-Custom-Domains-service-deprecation\">feature was steamrolled</a>.</p>\n<p>To be honest, I really struggled with keeping the blog up-to-date. It felt like every\nnew post I would start off by saying, “I know this is long overdue, but from now on,\nI’m going to start writing a post every x amount of time” which turned out to never\nbe true. Not only that, I felt as though I had limited myself in the number of topics\nI could write about since the original blog was targeted at programming and Computer\nScience.</p>\n<p>Thus, when my old domain expired and the link to my Medium publication broke, I decided\nnot to fix it and instead told myself that I will host my own blog. Along with that,\nI also made the decision to not limit myself in the type of content I write about. So,\nI’m telling myself and you now that anything goes, be it related to: programming,\nphilosophy, design — whatever.</p>\n<ul>\n<li>\n<p>Why the move</p>\n<ul>\n<li>wanting to take ownership of my content</li>\n<li>try some new tech (Gatsby.js)</li>\n<li>many of my favorite bloggers host their own blog </li>\n</ul>\n</li>\n<li>\n<p>Focus of this blog?</p>\n<ul>\n<li>gonna say anything goes (philosophical, programming, design, etc.)</li>\n<li>at the moment, no target audience (not trying to grow a mailing list); really\nwant to just improve my writing by doing it more often</li>\n</ul>\n</li>\n</ul>","frontmatter":{"title":"I Have Moved","date":"December 12, 2018"}}},"pageContext":{"slug":"/i-have-moved/","previous":null,"next":null}}