{"data":{"site":{"siteMetadata":{"title":"My Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"ae3b00db-0221-5408-bcf8-250693a8404b","excerpt":"Here’s How I Intend to Improve It The Problem I have been a Redditor for over six years and was a “lurker” for a year before\neven creating…","html":"<h2>Here’s How I Intend to Improve It</h2>\n<h3>The Problem</h3>\n<p>I have been a Redditor for over six years and was a “lurker” for a year before\neven creating my main account. During my time on Reddit, I have come across\namazing content, such as helpful LifeProTips and great book recommendations. When\nbrowsing dozens of posts and reading even more comments every day, it becomes\ndifficult trying to remember the most memorable content from a week, a month, or\neven a year ago. Fortunately, the engineers at Reddit were smart enough to develop\na way to save your favorite posts and comments. Unfortunately, however, the save\nfunctionality is nowhere near functional and is only slightly more useful if\nyou’re a Premium member.</p>\n<p>As a developer myself, I understand the need to monetize certain features of\nyour product in order to grow, but the problem with saving on Reddit is the fact\nthat the implementation is incomplete.</p>\n<p>For those unaware, saving things on Reddit as a non-Premium member works in the\nfollowing way:</p>\n<ul>\n<li>limited to 1000 saved things (posts and comments) total; once the limit is\nreached, older things are replaced and essentially deleted from history</li>\n<li>saves are stored in reverse chronological order (latest to oldest) </li>\n<li>no way whatsoever to filter or sort saved content</li>\n<li>no searching capbility is provided</li>\n<li>pagination limit on Reddit site is limited to 25 items, thus requiring users\nto use the “Next Page” or “Prev Page” buttons a lot</li>\n</ul>\n<p>Due to the organization of saved content and lack of basic discovery tools like\nfiltering, searching, and sorting paired with the pagination limit, finding some\nspecific content becomes a pain with as little as a few dozen saved items.</p>\n<p>For members with Reddit Premium, some of the outlined pain points are addressed.\nFor example, organization of saved content is improved with the ability to create\ncategories (think folders) which allow users to group related content. I’ve also\nheard that each category itself has a 1000 item limit rather than a hard 1000\nlimit for all saved content.</p>\n<p>However, there are still issues even if users are paying:</p>\n<ul>\n<li>no discovery tools (filter, search, or sort)</li>\n<li>categories disappear after Premium membership expires</li>\n<li>unable to rename or remove categories</li>\n<li>saves live on old.reddit.com (UI consistency issue if Redditor prefers “new”\nReddit design)</li>\n</ul>\n<p>Hopefully by now you can see how Reddit’s save feature is not functional from a\nuser’s perspective. What’s even more interesting in my opinion is the fact that\nReddit has the means to support the missing functionality. I know this because\ntheir public API exposes the necessary endpoints to make it possible. That’s why\nI’m creating a service that will improve Reddit’s poor implementation. </p>\n<h3>The Solution: unearth</h3>\n<p>The app is called “unearth” and is currently in the early stages of development.\nI chose unearth because it’s suppose to represent the action of “digging through\nyour saved content and finding gems you had forgotten about”.</p>\n<p>With unearth, I hope to alleviate the pain of discovering saved content for\nRedditors by adding the basic tools like searching and filtering while also\nbringing the ability to group content to those without Premium memberships.</p>\n<p>I also have more ambitious goals for unearth which I think others might enjoy:</p>\n<ul>\n<li>native reminder system (built-in RemindMeBot for those familiar with the account)</li>\n<li>email updates with featured saved posts</li>\n<li>backup system (importing and exporting of saved items)</li>\n</ul>\n<p>For those wondering, this would all be free and for the benefit of the users of\nunearth. As of now, I have no intent of monetizing unearth and only want to\nprovide the best service possible for all users.</p>\n<p>Some of you may be asking, What’s my end goal? In an ideal world, I think it\nwould be amazing if the product team at Reddit came across unearth and decided\nto fix Reddit saves natively. But if that doesn’t happen, I would be okay with\nbuilding this project and using it as leverage in order to land a job at Reddit.</p>\n<p>Want to stay up to date with unearth’s development and be given early beta access\nonce it’s ready? Sign up for the mailing list below!</p>\n<!-- TODO - add mailing list -->","frontmatter":{"title":"Reddit's Save Functionality Sucks","date":"January 09, 2019","draft":false}}},"pageContext":{"slug":"/making-reddit-saves-functional/","previous":{"fields":{"slug":"/building-side-projects/"},"frontmatter":{"title":"My Process of Building Side Projects"}},"next":null}}