{"data":{"site":{"siteMetadata":{"title":"My Random Thoughts","author":"Cedric Amaya"}},"markdownRemark":{"id":"6c2a97d5-cda2-57fa-b530-f72fc6befc8d","excerpt":"Originally published on the r/learnprogrammig subreddit. For those struggling and comparing themselves to others… I’m right there with you…","html":"<p><em>Originally published on the r/learnprogrammig subreddit.</em></p>\n<h4>For those struggling and comparing themselves to others…</h4>\n<p>I’m right there with you. I’ve been programming for about three years now and\nalthough I wouldn’t consider myself a beginner, I’m by no means an expert and\nstill feel like programming can be hard or that the code I write is shit. I\ncan’t help but see all of the other developers I follow on social media and\nthe projects they’re making and feel like I’ll never get there.</p>\n<p>The best advice I’ve heard until recently to dealing with this are sayings like\n“don’t compare your beginning to someone else’s middle”. That makes sense and I\nunderstood what it meant, but I was never really satisfied with when my “middle”\nwould manifest - I felt like no matter how many projects I made, I was not\nprogressing.</p>\n<p>That is until I heard Ira Glass’ advice for beginners.</p>\n<p>Simply put, Glass describes the idea that there is a gap between our good taste\n(the cool projects we aspire to one day write) and the stuff we actually make\n(the code we write/the projects we’re actually making). The gap represents our\ndissatisfaction with our work compared to the work that we aspire to someday\ncreate.</p>\n<p>I can’t summarize Glass’ words in their full glory but luckily the transcript\nisn’t too long, so I’ll paste it below:</p>\n<blockquote>\n<p><em>Nobody tells this to people who are beginners, and I really wish somebody had</em>\n<em>told this to me.</em></p>\n<p><em>All of us who do creative work, we get into it because we have good taste. But</em>\n<em>it’s like there is this gap. For the first couple years that you’re making</em>\n<em>stuff, what you’re making isn’t so good. It’s not that great. It’s trying to</em>\n<em>be good, it has ambition to be good, but it’s not that good.</em></p>\n<p><em>But your taste, the thing that got you into the game, is still killer. And</em>\n<em>your taste is good enough that you can tell that what you’re making is kind</em>\n<em>of a disappointment to you. A lot of people never get past that phase. They</em>\n<em>quit.</em></p>\n<p><em>Everybody I know who does interesting, creative work they went through years</em>\n<em>where they had really good taste and they could tell that what they were</em>\n<em>making wasn’t as good as they wanted it to be. They knew it fell short.</em>\n<em>Everybody goes through that.</em></p>\n<p><em>And if you are just starting out or if you are still in this phase, you gotta</em>\n<em>know its normal and the most important thing you can do is do a lot of work.</em>\n<em>Do a huge volume of work. Put yourself on a deadline so that every week or</em>\n<em>every month you know you’re going to finish one story. It is only by going</em>\n<em>through a volume of work that you’re going to catch up and close that gap.</em>\n<em>And the work you’re making will be as good as your ambitions.</em></p>\n<p><em>I took longer to figure out how to do this than anyone I’ve ever met. It</em>\n<em>takes awhile. It’s gonna take you a while. It’s normal to take a while.</em>\n<em>You just have to fight your way through that.</em></p>\n<p>—Ira Glass</p>\n</blockquote>\n<p>I’m not sure about you, but this explanation about the pursuit of evolving our\ncreativity made me have a light bulb moment.</p>\n<p>I think Glass perfectly describes why we shouldn’t “compare our beginning to\nsomeone else’s middle” while at the same time sheds light on the true struggle\nwe as beginners go through while honing our creative skills (such as programming).\nI also felt like the idea to create a volume of work in order to close the gap\nreally goes in hand with Malcolm Gladwell’s “10,000-Hour Rule”.</p>\n<p>Apologies for the wall of text, I’ll stop here. If you’re more of a visual\nlearner, the comic Zen Pencils has an excellent interpretation of Ira Glass’\nwords.<sup>1</sup> Happy coding and hopefully some of you will\nhave found this as insightful as I did!</p>\n<p><strong>EDIT</strong>: I’m ecstatic that so many of you have found this advice helpful. I\nmade Glass’ advice into a nice little r/GetMotivated-esque poster.<sup>2</sup></p>\n<hr>\n<ol>\n<li><a href=\"https://zenpencils.com/comic/90-ira-glass-advice-for-beginners/\">https://zenpencils.com/comic/90-ira-glass-advice-for-beginners/</a></li>\n<li><a href=\"https://i.redd.it/25ueejz4jj321.png\">https://i.redd.it/25ueejz4jj321.png</a></li>\n</ol>","frontmatter":{"title":"Advice for Beginners","date":"December 15, 2018","draft":false}}},"pageContext":{"slug":"/advice-for-beginners/","previous":{"fields":{"slug":"/i-have-moved/"},"frontmatter":{"title":"I Have Moved"}},"next":{"fields":{"slug":"/building-side-projects/"},"frontmatter":{"title":"My Process of Building Side Projects"}}}}